["REGISTRATION POLICY\nREGISTRATION POLICY\n1.0 Definitions\n1.1 The following words and expressions are specific to this document and shall have the meanings hereby assigned to them:\n1.1.1\nAcademic Advising:\nInteractions between a Student and an Academic Advisor\n        that involve discussing the Student’s academic plan, making appropriate\n        Course selections, academic progression, and learning outcomes.\n1.1.2\nAcademic Advisor:\nA representative of the University who helps and advises\n        Students on ", ".1.2\nAcademic Advisor:\nA representative of the University who helps and advises\n        Students on their academic plan, appropriate Course selections, academic\n        progression, and learning outcomes.\n1.1.3\nAcademic Calendar:\nA representation of the periods associated with the\n        University’s operations, containing the teaching periods, exam and holiday\n        dates, and key deadlines, which is approved by the University’s Board of\n        Trustees.\n1.1.4\nAcademic Council:\nThe academic governance ", "oved by the University’s Board of\n        Trustees.\n1.1.4\nAcademic Council:\nThe academic governance advisory body at the University\n        which plays a substantial and critical role in setting the academic direction of\n        the University.\n1.1.5\nAcademic Dismissal:\nA decision of the University to revoke the enrollment\n        status of a Student from a Program based on their Academic Standing\n1.1.6\nAcademic Members:\nFaculty Members and Instructional Members\n1.1.7\nAcademic Unit\n: An entity within the Un", "mic Members:\nFaculty Members and Instructional Members\n1.1.7\nAcademic Unit\n: An entity within the University that delivers Courses for\n        Programs or for entry into Programs.\n1.1.8\nAdd Course:\nThe action where a Student registers into additional Courses\n        during the Add/Drop Period.\n1.1.9\nAdd Deadline:\nThe last day of the Add Period for the Student to add Courses\n        to their schedule.\n1.1.10\nAdd/Drop Period\n: A period of time at the beginning of each Semester when\n        Students can adjust", "dd/Drop Period\n: A period of time at the beginning of each Semester when\n        Students can adjust schedules by cancelling their Course registration,\n        registering into additional Courses or changing Course Sections, defined in\n        the approved Academic Calendar.\n1.1.11\nApplicant:\nAn individual who has submitted and completed an application to\n        be admitted into a Program.\n1.1.12\nAuditing a Course\n: Attending and participating in a Course without receiving\n        academic Credit.\n1.1.13\nC", "Course\n: Attending and participating in a Course without receiving\n        academic Credit.\n1.1.13\nClear Standing:\nThe Academic Standing of a Student who has achieved the\n        minimum Cumulative GPA required by the Program.\n1.1.14\nCredit:\nA unit of measurement assigned to a Course based on the total amount\n        of learning time that counts toward a Program or credential completion, at a\n        particular level of the Qatar National Qualification Framework.\n1.1.15\nCourse:\nA set of Learning Sessions in", "ar level of the Qatar National Qualification Framework.\n1.1.15\nCourse:\nA set of Learning Sessions in a particular subject, with a defined\n        scope and duration, and specific learning outcomes.\n1.1.16\nCumulative GPA:\nThe overall cumulative grade point average across multiple\n        Semesters in a Student’s Program.\n1.1.17\nDiscontinued Student:\nA Student who was enrolled in a Program and has\n        either not registered for a subsequent Semester, registered in a current\n        Semester but not attende", "r not registered for a subsequent Semester, registered in a current\n        Semester but not attended any classes, has withdrawn voluntarily or\n        involuntarily, or has been suspended.\n1.1.18\nDismissal:\nA decision of the University to revoke the enrollment status of a\n        Student.\n1.1.19\nDrop Course:\nThe action where a Student drops Courses during the Add//Drop\n        Period thereby cancelling his/her Course registration.\n1.1.20\nDrop Deadline:\nThe last day of the Drop Period as per the Academic Ca", "er Course registration.\n1.1.20\nDrop Deadline:\nThe last day of the Drop Period as per the Academic Calendar.\n1.1.21\nFull-Time Student:\nAn Undergraduate Student registered in 12 or more Credits\n        per week, or a Graduate Student registered in 9 or more Credits per week.\n1.1.22\nFaculty Member:\nMembers of the teaching and/or research staff, whether on\n        part- or full-time, holding the following ranks: Professor, Associate Professor,\n        Assistant Professor, Senior Lecturer/Senior Technical Instru", "Professor, Associate Professor,\n        Assistant Professor, Senior Lecturer/Senior Technical Instructor, or\n        Lecturer/Technical Instructor.\n1.1.23\nFinal Grade:\nThe grade assigned for the entire Course when all Final Grade\n        Components of the Course are completed.\n1.1.24\nFinal Grade Components:\nThe elements which, when computed, total the\n        Final Grade for the Course.\n1.1.25\nFoundation Program:\nA series of University Courses designed to prepare\n        Students for their Program.\n1.1.26\nI", "ram:\nA series of University Courses designed to prepare\n        Students for their Program.\n1.1.26\nInstructional Members:\nMembers of the teaching staff, whether on part- or fulltime, holding the following titles: Assistant Lecturer/or Workshop/Lab/Clinical\n        Instructor, Assistant Technical Instructor, Trades Technical Instructor, or\n        Teaching Assistant.\n1.1.27\nPart-Time:\nAn Undergraduate Student registered in less than 12 Credits per\n        week or a Graduate Student registered in less than 9 ", "registered in less than 12 Credits per\n        week or a Graduate Student registered in less than 9 Credits per week.\n1.1.28\nProgram:\nA prescribed set of Courses leading to a qualification, including a\n        Certificate, Diploma (2 years), Advanced Diploma (3 years), Bachelor, Master,\n        or Doctorate, according to the Qatar National Qualifications Framework\n1.1.29\nPresident:\nThe President of the University, as nominated by the Board and appointed by the Minister of Education and Higher Education as P", "sity, as nominated by the Board and appointed by the Minister of Education and Higher Education as President of the University.\n1.1.30\nRe-admission:\nThe process in which an Applicant is admitted (or denied) into a University Program, when an Applicant has previously been admitted as a Student but has been Dismissed or has become a Discontinued Student.\n1.1.31\nRegistration Period:\nA period of time prior to the beginning of each Semester when Students can enroll in Courses.\n1.1.32\nSection\n: A Course offering ", " beginning of each Semester when Students can enroll in Courses.\n1.1.32\nSection\n: A Course offering distinguished from other identical Course offerings by date, time, location, instructor, etc.\n1.1.33\nSemester:\nA division of an Academic Year where a Student is enrolled in a Course(s) followed by an examination period.\n1.1.34\nStudent\n: A person who is presently enrolled at the University in a Credit course or who is designated by the University as a Student.\n1.1.35\nTranscript\n: An official document of the Un", "who is designated by the University as a Student.\n1.1.35\nTranscript\n: An official document of the University summarizing the entire academic records of a Student including essential information pertaining to the Student's courses, grades, academic standing and credential attainment.\n1.1.36\nUniversity\n: University of Doha for Science and Technology established by Emiri Resolution No. 13 of 2022.\n1.1.37\nWithdraw:\nAn action where a Student withdraws from a Course during the Withdrawal Period resulting in a Wit", "w:\nAn action where a Student withdraws from a Course during the Withdrawal Period resulting in a Withdraw Grade.\n1.1.38\nWithdraw Grade\n: A Final Grade of W assigned and entered on the transcript to indicate a Student’s official withdrawal from a Course within the Withdrawal Period.\n1.1.39\nWithdrawal Period\n: The timeframe determined by the University and extending from the end of the Add\\Drop period until the middle of the Semester.\n1.2 Where the context requires, words importing the singular shall include ", " middle of the Semester.\n1.2 Where the context requires, words importing the singular shall include the plural and vice-versa.\n1.3 Where a word or phrase is given a particular meaning, other parts of speech and grammatical forms of that word or phrase have corresponding meanings.\n2.0 Policy Purpose\n2.1 The purpose of this policy is to determine principles and authorities for developing standard registration requirements for all University Courses and Programs.\n2.2 To establish timelines that govern all regi", "equirements for all University Courses and Programs.\n2.2 To establish timelines that govern all registration related issues.\n3.0 Policy Scope\n3.1 This policy applies to:\n3.1.1 Academic Units;\n3.1.2 Academic Members;\n3.1.3 Admissions and Registration Department;\n3.1.4 Students;\n3.1.5 Relevant University Councils and Committees.\n4.0 Policy Statement\nThis policy supersedes prior versions of the Registration Policy (AC-103) and associated Registration Operational Procedure (AC-103-PR).\n4.1 General\n4.1.1 Subject", "cy (AC-103) and associated Registration Operational Procedure (AC-103-PR).\n4.1 General\n4.1.1 Subject to the approval of the President and the Academic Council, the Director, Admissions and Registration Directorate is responsible for determining the Registration Period dates. The Admissions and Registration Directorate is responsible for announcing the Registration Period to Students through the Academic Calendar.\n4.1.2 It is the policy of the University that all Students will register into Courses prior to ", "dar.\n4.1.2 It is the policy of the University that all Students will register into Courses prior to the start of each Semester, as per the pertinent procedure.\n4.1.3 Students will not be officially registered in any Course until they have complied with all registration requirements per the Registration Procedure (PR-ST-09).\n4.1.4 Students who have satisfied all registration requirements will be permitted to register only for those Courses for which study plan prerequisites have been met.\n4.1.5 Students have", "egister only for those Courses for which study plan prerequisites have been met.\n4.1.5 Students have the opportunity to Add and/or Drop Courses anytime during the Registration Period and until the end of the Add/Drop Period. A Dropped Course is not entered on the Transcript and no Final Grade is assigned.\n4.1.6 At the end of the Add/Drop Period, Students can Withdraw from Courses until the end of Withdrawal Period without academic prejudice. A Final Grade of a W will be assigned and entered on the Transcrip", "eriod without academic prejudice. A Final Grade of a W will be assigned and entered on the Transcript to indicate an official withdrawal has taken place.\n4.1.7 Students may register on a Full-Time or Part-Time enrollment basis.\n4.1.8 The relevant Department Chair must grant approval for Students to Audit a Course. Foundation Program Students may not audit Foundation Program Courses.\n4.1.9 Academic Units are to provide Academic Advising to Students in support of their registration.\n4.1.10 Students may not at", "o provide Academic Advising to Students in support of their registration.\n4.1.10 Students may not attend Courses for which they have not registered.\n4.1.11 Discontinued Students are required to apply for Re-admission to the University before registering in Courses.\n4.1.12 Registration requirements and procedures are further outlined in the Registration Procedure (PR-ST-09).\n5.0 Procedures\nThe Vice-President, Student Affairs will ensure that procedures are developed for the execution of this policy, and are ", "Student Affairs will ensure that procedures are developed for the execution of this policy, and are implemented accordingly.\n6.0 Related Documents\n6.1 PL-ST-02: Academic Schedule Policy\n6.2 PL-ST-03: Attendance Policy\n6.3 PL-ST-05: Academic Standing Policy\n6.4 PL-ST-06: Transfer Policy\n6.5 PL-ST-07: Admissions Policy\n6.6 PL-ST-08: Final Grade Policy\n6.7 PL-AC-07: Examination Policy\nPL-ST-09: Registration Policy ©\nNovember 2021"]