["Scholarship and Financial Assistance Policy\n1.0 Definitions\n1.1 The following words and expressions have the meaning hereby assigned to them:\n1.1.1\nAcademic Calendar:\nA representation of the periods associated with the University’s operations, containing the teaching periods, exam and holiday dates, and key deadlines, which is approved by the University’s Board of Trustees.\n1.1.2\nAcademic Scholarship:\nA Scholarship Award granted to a Student in recognition of academic excellence.\n1.1.3\nAcademic Year:\nMeans ", "arship Award granted to a Student in recognition of academic excellence.\n1.1.3\nAcademic Year:\nMeans the 12-month period defined in the University's Academic Calendar, as approved by the Board.\n1.1.4\nAdmission:\nThe process in which Applicants are evaluated for entry into a University Program.\n1.1.5\nApplicant:\nAn individual that has submitted and completed an application to be admitted into a Program.\n1.1.6\nBoard:\nBoard of Trustees of the University.\n1.1.7\nBusiness Unit\n: Any area of the University headed by ", "rd:\nBoard of Trustees of the University.\n1.1.7\nBusiness Unit\n: Any area of the University headed by the President, Vice-President, Associate Vice-President, Director, Manager, Dean, or Academic Manager, as the case may be.\n1.1.8\nContinuing and Professional Education:\nA non-credit instructional program that brings participants up to date in a particular area of knowledge or skills.\n1.1.9\nCounselor:\nA person trained to give guidance on personal or psychological problems.\n1.1.10\nCourse:\n: A set of Learning Ses", "ained to give guidance on personal or psychological problems.\n1.1.10\nCourse:\n: A set of Learning Sessions in a particular subject, with a defined scope and duration, and specific learning outcomes.\n1.1.11\nCredit:\nA unit of measurement assigned to a Course based on the total amount\n        of learning time that counts toward a Program or credential completion, at a\n        particular level of the Qatar National Qualification Framework.\n1.1.12\nCumulative GPA:\nThe overall cumulative grade point average across ", "l Qualification Framework.\n1.1.12\nCumulative GPA:\nThe overall cumulative grade point average across multiple\n        Semesters in a Student’s Program.\n1.1.13\nFinal Grade:\nThe grade assigned for the entire Course when all Final Grade\n        Components of the Course are completed.\n1.1.14\nFinal Grade Components:\nThe elements which, when computed, total the\n        Final Grade for the Course.\n1.1.15\nFinancial Assistance Award:\nA monetary award granted by a third party provider to a Student on the basis of Fina", "sistance Award:\nA monetary award granted by a third party provider to a Student on the basis of Financial Need.\n1.1.16\nFinancial Need:\nThe difference between the cost of tuition and ability to pay.\n1.1.17\nFull-Time:\nAn Undergraduate Student registered in 12 or more Credits per week, or a Graduate Student registered in 9 or more Credits per week.\n1.1.18\nProgram:\nA prescribed set of Courses leading to a qualification, including a Certificate, Diploma (2 years), Advanced Diploma (3 years), Bachelor, Master, or", "cation, including a Certificate, Diploma (2 years), Advanced Diploma (3 years), Bachelor, Master, or Doctorate, according to the Qatar National Qualifications Framework.\n1.1.19\nScholarship Agreement:\nA contract between the Scholarship giver and a Student outlining the terms under which the Student will be given the Scholarship.\n1.1.20\nScholarship Award:\nEither an Academic Scholarship or Talent Scholarship granted by the University to a Scholarship Award Recipient which is merit-based and recognizes achievem", "nted by the University to a Scholarship Award Recipient which is merit-based and recognizes achievement, performance, or other criteria approved by the Board.\n1.1.21\nScholarship Award Recipient:\nAn individual receiving a University Scholarship Award.\n1.1.22\nScholarship Committee:\nA Committee appointed to review Scholarship Award applications, select Scholarship Award Recipients, and decide upon Scholarship appeals.\n1.1.23\nSemester:\nA division of an Academic Year where a Student is enrolled in a Course(s) fo", "peals.\n1.1.23\nSemester:\nA division of an Academic Year where a Student is enrolled in a Course(s) followed by an examination period.\n1.1.24\nStaff:\nPerson(s) employed by or working at the University as Academic Members or providing administrative support.\n1.1.25\nStudent:\nA person who is presently enrolled at the University in a Credit Course or who is designated by the University as a Student.\n1.1.26\nStudent Employment Program:\nA co-curricular employment experience for Students.\n1.1.27\nTalent Scholarship:\nA ", "mployment Program:\nA co-curricular employment experience for Students.\n1.1.27\nTalent Scholarship:\nA Scholarship Award granted to a Student on the basis of natural endowment in a particular field or ability of superior quality.\n1.1.28\nUniversity:\nUniversity of Doha for Science and Technology established by Emiri Resolution No.13 of 2022.\n1.1.29\nWithdraw:\nAn action where the Student withdraws from a Course during the Withdrawal Period resulting in a Withdraw Grade.\n1.1.30\nWithdraw Grade:\nThe Final Grade of W ", "ng the Withdrawal Period resulting in a Withdraw Grade.\n1.1.30\nWithdraw Grade:\nThe Final Grade of W assigned and entered on the transcript to indicate the Student’s official withdrawal from a Course.\n1.1.31\nWithdrawal Period:\nThe timeframe determined by the University and extending from the end of the Add\\Drop Period until the middle of the Semester.\n1.2 Where the context requires, words importing the singular shall include the plural and vice-versa.\n1.3 Where a word or phrase is given a particular meaning,", "r shall include the plural and vice-versa.\n1.3 Where a word or phrase is given a particular meaning, other parts of speech and grammatical forms of that word or phrase have corresponding meanings.\n2.0 Policy Purpose\n2.1 To establish standards and guidelines for Scholarship Awards and Financial Assistance Awards.\n2.2 To outline the commitments of the University and delineate the requirements and responsibilities for Scholarship and Financial Assistance Applicants and Recipients.\n3.0 Policy Scope\n3.1 This pol", "es for Scholarship and Financial Assistance Applicants and Recipients.\n3.0 Policy Scope\n3.1 This policy applies to Scholarship Awards and Financial Assistance including:\n3.1.1 Residents and international Applicants seeking Admission to the University.\n3.1.2 Students enrolled at the University.\n3.1.3 All Business Units and Staff of the University involved in the awarding and management of Scholarship Awards and Financial Assistance.\n3.2 The policy does not apply to the Continuing and Professional Education D", "d Financial Assistance.\n3.2 The policy does not apply to the Continuing and Professional Education Directorate’s offerings.\n4.0 Policy Statement\n4.1 Categories\nThe University supports the following:\n4.1.1 Scholarship Awards\n4.1.1.1 Academic Scholarship\nThese awards are based on academic merit and consider the Student’s academic success in high school and University grades.\n4.1.1.2 Talent Scholarship\nA Talent Scholarship award is contingent upon the Student’s distinguished ability and achievements in either ", "Scholarship award is contingent upon the Student’s distinguished ability and achievements in either sport, arts or the sciences, alongside academic merit.\n4.1.2 Financial Assistance Awards\n4.1.2.1 Financial Assistance is offered by third party providers subject to applicable legislation and agreements between the University and the Financial Assistance provider(s).\n4.1.2.2 The Financial Assistance provider(s) determines criteria and eligibility, determines the value, and oversees the review and award proces", " determines criteria and eligibility, determines the value, and oversees the review and award process for their Financial Assistance Awards.\n4.1.2.3 The Financial Assistance provider(s) determines the duration of the Financial Assistance Award and the criteria for maintaining the Financial Assistance Award.\n4.1.2.4 The Financial Assistance provider(s) determines the conditions under which the Financial Assistance Award can be cancelled and criteria for appeal, if any.\n4.1.2.5 The Financial Assistance provid", "ance Award can be cancelled and criteria for appeal, if any.\n4.1.2.5 The Financial Assistance provider outlines the terms and conditions for the Financial Assistance Award in the Financial Assistance Award Letter.\n4.1.2.6 The Financial Assistance provider is responsible for payment of the Financial Assistance Recipient’s tuition and related fees per the terms and conditions outlined by the Financial Assistance provider in the Financial Assistance Award Letter.\n4.1.2.7 The Admissions and Registration Directo", "e provider in the Financial Assistance Award Letter.\n4.1.2.7 The Admissions and Registration Directorate will provide assistance to the Financial Assistance provider(s) throughout the process per the agreement between the University and the Financial Assistance provider.\n4.1.2.8 Third party Financial Assistance providers may require Financial Assistance Recipients to sign a document detailing the terms and conditions associated with their Financial Assistance Award.\n5.0 Scholarship Eligibility\n5.1 Scholarsh", "nditions associated with their Financial Assistance Award.\n5.0 Scholarship Eligibility\n5.1 Scholarship Application and Awards\n5.1.1 Applicants must meet or exceed the minimum criteria for Scholarship Award consideration per the Scholarship and Financial Assistance Procedure (PR-ST-11).\n5.1.2 As Scholarship categories vary, applications will be evaluated by the Scholarship Committee per the eligibility requirements outlined in the Scholarship and Financial Assistance Procedure (PR-ST-11).\n5.1.3 The Scholarsh", "ments outlined in the Scholarship and Financial Assistance Procedure (PR-ST-11).\n5.1.3 The Scholarship categories, their value, Award duration, and maintenance criteria will be determined at the time a Scholarship category is proposed by the President, for Board approval, in alignment with the Emiri Decision.\n5.1.4 Unless the Scholarship Award specifically prohibits it, Recipients of a Scholarship Award can apply for Student Employment Program consideration.\n5.1.5 Recipients receiving a Scholarship Award ar", "pply for Student Employment Program consideration.\n5.1.5 Recipients receiving a Scholarship Award are eligible to apply for a higher value Scholarship Award in subsequent application periods.\n5.2 Maintenance of Scholarship Awards\n5.2.1 Scholarship Awards are reviewed at the end of each Academic Year by the Director, Admissions and Registration (Registrar) to ensure that Recipients have satisfied the Scholarship Award’s minimum maintenance criteria.\n5.2.2 In order to maintain their Scholarship Award, Recipie", "ip Award’s minimum maintenance criteria.\n5.2.2 In order to maintain their Scholarship Award, Recipients must attain the minimum Cumulative Grade Point Average, earned Credit requirement, and satisfy any other conditions as per the Scholarship and Financial Assistance Procedure (PR-ST-11), and which are detailed in the Recipient’s Scholarship Agreement.\n5.2.3 Scholarship Award Recipients must be registered as Full-Time Students, unless approved for a reduced Course load by the Director, Admissions and Regist", "Full-Time Students, unless approved for a reduced Course load by the Director, Admissions and Registration (Registrar), based on Course load reduction criteria detailed in the Scholarship and Financial Assistance Procedure (PR-ST-11).\n5.2.4 On the recommendation of a University Counselor, Scholarship Award Recipients with a disability who are approved for a reduced Course load based on the individual Recipient’s revised Full-Time definition.\n5.2.5 Unless a deferral is granted, Scholarship Awards are made fo", "t’s revised Full-Time definition.\n5.2.5 Unless a deferral is granted, Scholarship Awards are made for the duration of the Program (i.e., 2 years for a Master’s Degree, 4 years for a Bachelor’s Degree, 2 years for Diploma, and 1 year for the Foundation Program) or the remaining duration required to complete the Program, whichever is shorter.\n6.0 Responsibilities of Scholarship Award Recipients\n6.1 Scholarship Award Recipients are required to sign the Scholarship Agreement and are expected to maintain all the", "Award Recipients are required to sign the Scholarship Agreement and are expected to maintain all the requirements outlined therein.\n6.2 Scholarship Award Recipients are expected to adhere to the University policies and regulations and abide by the Student Conduct Policy (PL-ST-01).\n6.3 Scholarship Award Recipients are expected to attend classes, contribute positively to class discussions, and be active participants in the learning process.\n7.0 Deferral of a Scholarship Award\n7.1 The Scholarship Award is for", "ipants in the learning process.\n7.0 Deferral of a Scholarship Award\n7.1 The Scholarship Award is for a fixed duration as specified in the Scholarship Agreement. Scholarship Award Recipients are expected to remain continuously enrolled throughout the tenure of their Scholarship Award, Summer Semester excluded.\n7.2 No gap in study and/or deferral of Scholarship Award is allowed without prior approval from the Director, Admissions and Registration (Registrar), subject to the criteria and procedures detailed in", "irector, Admissions and Registration (Registrar), subject to the criteria and procedures detailed in the Scholarship and Financial Assistance Procedure (PR-ST-11).\n7.3 Scholarship Award Recipients can request to defer their Scholarship Award for up to a maximum combined duration not exceeding 12 months over the lifetime of the Scholarship Award.\n7.4 If the Scholarship Award Recipient experiences a gap in study without securing the prior approval of the Director, Admissions and Registration (Registrar), the ", "y without securing the prior approval of the Director, Admissions and Registration (Registrar), the period of discontinuation in their study is computed towards the duration of the Scholarship Award.\n7.5 Scholarship Award Recipients who, without prior approval, experience a gap in their study resulting from extenuating circumstances (accident, illness, etc.) can submit an appeal to the Scholarship Committee requesting a retroactive deferral for the period of discontinuation in their study, not exceeding the", "equesting a retroactive deferral for the period of discontinuation in their study, not exceeding the 12 month maximum combined duration over the lifetime of the Scholarship Award.\n8.0 Cancellation of a Scholarship Award\n8.1 Scholarship Awards are reviewed at the end of each Academic Year by the Director, Admissions and Registration (Registrar) to ensure that Recipients have satisfied the Scholarship Award’s minimum maintenance criteria.\n8.2 Scholarship Award Recipients who fail to satisfy the Scholarship Aw", "inimum maintenance criteria.\n8.2 Scholarship Award Recipients who fail to satisfy the Scholarship Award’s minimum maintenance criteria will have their Scholarship Award cancelled.\n8.3 Scholarship Award Recipients who, due to extenuating circumstances (accident, illness, etc.), have had their Scholarship canceled for failure to satisfy the maintenance requirements can submit an appeal to the Scholarship Committee requesting re-instatement of their Scholarship Award.\n8.4 Scholarship Award Recipients who have ", "tee requesting re-instatement of their Scholarship Award.\n8.4 Scholarship Award Recipients who have had their Scholarship cancelled for failure to satisfy the maintenance requirements can re-apply for Scholarship consideration in a subsequent Academic Year provided they achieve the\n\nminimum application requirements, as outlined in the Scholarship and Financial Assistance Procedure (PR-ST-11).\n8.5 Scholarship Award Recipients who Withdraw from the University without deferral approval from the Director, Admis", "Award Recipients who Withdraw from the University without deferral approval from the Director, Admissions and Registration (Registrar) will have their Scholarship Award cancelled.\n8.6 Scholarship Award Recipients who are not enrolled for a combined duration of more than 12 months over the lifetime of the Scholarship Award, will have their Scholarship Award cancelled.\n8.7 Scholarship Award Recipients who violate the University’s Student Conduct Policy (PL-ST-01) will have their Scholarship Award revoked at t", "te the University’s Student Conduct Policy (PL-ST-01) will have their Scholarship Award revoked at the conclusion of the Semester in which the violation occurred. Students who have their Scholarship Award revoked for violating the University’s Student Conduct Policy (PL-ST-01) can appeal to the Student Misconduct Committee, if the violation is appealable, as per the provisions of the Student Conduct Policy (PL-ST-01). Successful appeals will result in the Scholarship Award being reinstated.\n8.8 There is no ", "L-ST-01). Successful appeals will result in the Scholarship Award being reinstated.\n8.8 There is no warning/probation period and unless stated otherwise in this Policy or the Scholarship and Financial Assistance Procedure (PR-ST-11), the Scholarship Award is cancelled at the conclusion of the Semester.\n9.0 General\n9.1 Tuition Waiver\nScholarship Awards are tuition waivers and are applied as a tuition credit to the University’s tuition assessment. The Student Award Recipient is eligible to receive the value o", " the University’s tuition assessment. The Student Award Recipient is eligible to receive the value of the award in cash after all tuition and related fees owed to the University are paid.\n9.2 Tuition Transferability\nScholarship Awards are only applied to the University’s tuition fees. With the exception of official University exchange programs, Scholarship Recipients attending another institution cannot apply Scholarship Awards provided by the University towards the cost of tuition at another institution.\n9", " Scholarship Awards provided by the University towards the cost of tuition at another institution.\n9.3 Exchange Students\nUniversity Students who participate in an official University exchange program and pay tuition fees to the University can receive their Scholarship Award while participating in the exchange program.\n9.4 Non-Tuition Expenses\nScholarship Awards provided by the University are applied to the University’s tuition and related fees only and cannot be applied to non-tuition related expenses inclu", "iversity’s tuition and related fees only and cannot be applied to non-tuition related expenses including but not limited to transportation, meals, books, and personal supplies.\n9.5 Retroactive Awards\nScholarship Awards provided by the University cannot be applied retroactively.\n\nThe Award becomes active on the effective date indicated on the Scholarship Agreement.\n10.0 Scholarship Committee\n10.1 The Scholarship Committee is responsible for reviewing Scholarship applications and selecting Scholarship Award R", "ip Committee is responsible for reviewing Scholarship applications and selecting Scholarship Award Recipients.\n10.2 The Scholarship Committee is responsible for reviewing and deciding upon all Scholarship appeals.\n11.0 Procedures\n11.1 The Vice-President, Student Affairs will ensure that procedures are developed for the implementation of this policy.\n12.0 Related Documents\n12.1 PL-ST-01: Student Conduct Policy\n12.2 PL-ST-05: Academic Standing Policy\n12.3 PL-ST-07: Admissions Policy\n12.4 PL-ST-09: Registratio", "\n12.2 PL-ST-05: Academic Standing Policy\n12.3 PL-ST-07: Admissions Policy\n12.4 PL-ST-09: Registration Policy\n12.5 PL-ST-18: Graduate Academic Standing Policy\n12.6 PR-ST-11: Scholarship and Financial Assistance Procedure\n15.0 Annexes (e.g. Visio maps, Handbook, etc.)\n15.1 Scholarship Committee Terms of Reference\nPL-ST-11: Scholarship and Financial Assistance Policy ©\nMarch 2023"]